app/controllers/projects_controller.rb

INSERT INTO "projects" ("name") VALUES ($1) RETURNING "id"  [["name", ""]]
---
  def create
    @project = Project.create(project_params)