app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all

    if params[:completed] == "true"
      @tasks = @tasks.where({completed: true})
---
SELECT "tasks".* FROM "tasks"
SELECT "tasks".* FROM "tasks"  WHERE "tasks"."completed" = 't'

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("created_at", "description", "due_date", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-12-05 21:45:32.466721"], ["description", "finish due dates"], ["due_date", "2014-12-11"], ["updated_at", "2014-12-05 21:45:32.466721"]]

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "due_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = 5  [["due_date", "2014-12-17"], ["updated_at", "2014-12-05 21:50:04.356509"]]