app/controllers/users_controller.rb

INSERT INTO "users" ("email", "first_name", "last_name") VALUES ($1, $2, $3) RETURNING "id"  [["email", ""], ["first_name", ""], ["last_name", ""]]
---
  def create
    @user = User.create(user_params)

UPDATE "users" SET "email" = $1, "first_name" = $2, "last_name" = $3 WHERE "users"."id" = 1  [["email", "adjfla@gmail.com"], ["first_name", "eka"], ["last_name", "lim"]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)